// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.Clear();
// int i = new Random(). Next(100,1000);
// Console.WriteLine(i);
// int a = i / 10 % 10;
// Console.WriteLine (a);
//-------------------------------------------------------------------------------------------------------

// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.Clear();
// Console.WriteLine("Введите число ");
// int a = Convert.ToInt32(Console.ReadLine());
// while (a > 999)
//     a /= 10;
// if (a < 100)
//     Console.WriteLine("третий цифры нет");
// else 
//      Console.WriteLine(a % 10);
//-----------------------------------------------------------------------

// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Console.Clear();
// Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// if (a == 7 || a == 6)
//     Console.WriteLine("Это выходной");
// else if (a > 0 && a < 5)
//     Console.WriteLine("Это будний");
// else if (a < 1 || a > 6)
//      Console.WriteLine("Как бы не хотелось, такого дня недели нет");





